Documents/си_ПогашениеСтоимостиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>си_ПогашениеСтоимостиМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.си_МатериалыНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.си_МатериалыВЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/си_МатериалыВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>си_МатериалыВЭксплуатации</Name>
			<Comment>осуществляется учет материалов, находящихся в эксплуатации</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаннаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.си_КодыОперацийМатериалыВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.си_ПередачаМатериаловВЭксплуатацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОстаточныйСрокИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_ХарактеристикиСпецодеждыИИнвентаря</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/си_ВыработкаМатериаловВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>си_ВыработкаМатериаловВЭксплуатации</Name>
			<Comment>осуществляется учет оборотов материалов, находящихся в эксплуатации</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоОборотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.си_ПередачаМатериаловВЭксплуатацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_ХарактеристикиСпецодеждыИИнвентаря</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/си_МатериалыНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>си_МатериалыНаСкладе</Name>
			<Comment>Для учета материалов на складе, как новых так и возвращенных из эксплуатации</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаннаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.си_КодыОперацийМатериалыВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.си_ПередачаМатериаловВЭксплуатацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОстаточныйСрокИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_ХарактеристикиСпецодеждыИИнвентаря</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеСпецодежды</Name>
					<Type>
						<v8:Type>cfg:EnumRef.си_СостояниеСпецодеждыИИнвентаряНаСкладе</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.си_ВозвратМатериаловИзЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/си_НазначенияИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>си_НазначенияИспользования</Name>
			<Comment>Назначения использования</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособПогашенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.си_СпособыПогашенияСтоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриостанавливатьАмортизациюНаВремяВозврата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпособыОтраженияРасходовПоАмортизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияРасходовПоАмортизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Способы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/си_ПогашениеСтоимостиМатериалов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Возврат;	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПодготовитьТаблицуМатериаловСУчетомСписанияСоСледующегоМесяца(ПараметрыПроведения,Ссылка) Экспорт
	УчетнаяПолитика = си_УчетСпецодеждыСерверПовтИсп.ПолучитьУчетнуюПолитикуВеденияСпецодеждыИИнвентаря(Ссылка.Дата);
	Если УчетнаяПолитика.ПорядокНачисленияАмортизации = Перечисления.си_ПорядокНачисленияАмортизации.СоСледующегоМесяца Тогда
		ТаблицаВспомогательнаяПереданныеМатериалы = ПараметрыПроведения.ТаблицаВспомогательнаяПереданныеМатериалы;
		ТаблицаСпецодежда = ПараметрыПроведения.ТаблицаСпецодежда;
		
		Для Каждого СтрокаТЧ Из ТаблицаВспомогательнаяПереданныеМатериалы Цикл
			
			ПараметрыПоиска = Новый Структура();
		    
			ПараметрыПоиска.Вставить("ПодразделениеОрганизации", СтрокаТЧ.ПодразделениеОрганизации);
			ПараметрыПоиска.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
			ПараметрыПоиска.Вставить("ДокументПередачи", СтрокаТЧ.ДокументПередачи);
			ПараметрыПоиска.Вставить("Сотрудник", СтрокаТЧ.Сотрудник);
			ПараметрыПоиска.Вставить("НазначениеИспользования", СтрокаТЧ.НазначениеИспользования);
			ПараметрыПоиска.Вставить("ВидУчетаНУ", СтрокаТЧ.ВидУчетаНУ);
			ПараметрыПоиска.Вставить("ОстаточныйСрокИспользования", СтрокаТЧ.ОстаточныйСрокИспользования);
			ПараметрыПоиска.Вставить("Характеристика", СтрокаТЧ.Характеристика);
			
			НайденныеСтроки = ТаблицаСпецодежда.НайтиСтроки(ПараметрыПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ТаблицаСпецодежда.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ДополнительныеЗапросы = Новый Массив;
	ДополнительныеЗапросы.Добавить("СпецодеждаВЭксплуатации");
	ДополнительныеЗапросы.Добавить("СпецодеждаБУ");

	ДатаДокумента = ДокументСсылка.Дата;

	ДополнительныеПараметрыЗапросов	 = Новый Структура;
	//ДополнительныеПараметрыЗапросов.Вставить("МоментВремени", 				Новый МоментВремени(ДатаДокумента,ДокументСсылка));
	ДополнительныеПараметрыЗапросов.Вставить("Организация", 				ДокументСсылка.Организация);
	ДополнительныеПараметрыЗапросов.Вставить("СтруктурноеПодразделение", 	ДокументСсылка.СтруктурноеПодразделение);
	ДополнительныеПараметрыЗапросов.Вставить("НачалоПериода", 				НачалоМесяца(ДатаДокумента));
	ДополнительныеПараметрыЗапросов.Вставить("КонецПериода", 				КонецМесяца(ДатаДокумента));
	////
	УчетнаяПолитика = си_УчетСпецодеждыСерверПовтИсп.ПолучитьУчетнуюПолитикуВеденияСпецодеждыИИнвентаря(ДокументСсылка.Дата);
	ДополнительныеПараметрыЗапросов.Вставить("АмортизироватьВМесяцВозврата",УчетнаяПолитика.АмортизироватьМатериалыНаСкладеВМесяцВозврата);
	ДополнительныеПараметрыЗапросов.Вставить("МоментВремениТекущий",		Новый МоментВремени(ДатаДокумента,ДокументСсылка));
	//Если УчетнаяПолитика.ПорядокНачисленияАмортизации = Перечисления.си_ПорядокНачисленияАмортизации.СоСледующегоМесяца Тогда
	//	ДополнительныеПараметрыЗапросов.Вставить("МоментВремени", 				Новый МоментВремени(КонецМесяца(ДобавитьМесяц(ДатаДокумента,-1)),ДокументСсылка));
	//	ДополнительныеПараметрыЗапросов.Вставить("НачалоПериодаВозврата",		НачалоМесяца(ДобавитьМесяц(ДатаДокумента,-1)));
	//	ДополнительныеПараметрыЗапросов.Вставить("КонецПериодаВозврата",		КонецМесяца(ДобавитьМесяц(ДатаДокумента,-1)));	
	//Иначе
		ДополнительныеПараметрыЗапросов.Вставить("МоментВремени", 				Новый МоментВремени(ДатаДокумента,ДокументСсылка));
		ДополнительныеПараметрыЗапросов.Вставить("НачалоПериодаВозврата",		НачалоМесяца(ДатаДокумента));
		ДополнительныеПараметрыЗапросов.Вставить("КонецПериодаВозврата",		КонецМесяца(ДатаДокумента));
	//КонецЕсли;
	
	///
	ДополнительныеДанные = Новый Структура("УчетнаяПолитикаСтроительнойОрганизации",ДатаДокумента);

	ПараметрыПроведения = си_УчетСпецодеждыУправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка,Отказ,Истина,Истина,ДополнительныеДанные,,,,ДополнительныеПараметрыЗапросов,ДополнительныеЗапросы);

	Возврат ПараметрыПроведения;

КонецФункции 

Функция ТекстЗапросаСпецодеждаВЭксплуатации(НомераТаблиц,ПараметрыПроведения, Реквизиты)  Экспорт

	ЭтоБСО = си_УчетСпецодеждыСерверПовтИсп.ПроверкаНаБСО();
	Если ЭтоБСО Тогда 
		ТекстЗапроса = "";
		
		Если Метаданные.РегистрыСведений.Найти("бсо_РаспределениеОсновногоЗаработкаРаботниковОрганизаций")<>Неопределено Тогда
			ИмяРегистраРаспределенияПоТабелю = "бсо_РаспределениеОсновногоЗаработкаРаботниковОрганизаций";
			Префикс = "";
		ИначеЕсли Метаданные.РегистрыСведений.Найти("си_РаспределениеОсновногоЗаработкаРаботниковОрганизаций")=Неопределено Тогда
			ИмяРегистраРаспределенияПоТабелю = "РаспределениеОсновногоЗаработкаРаботниковОрганизаций";
			Префикс = "уфсо_";
		Иначе
			ИмяРегистраРаспределенияПоТабелю = "си_РаспределениеОсновногоЗаработкаРаботниковОрганизаций";
			Префикс = "";
		КонецЕсли;
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	МатериалыВЭксплуатации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
			|	МатериалыВЭксплуатации.Номенклатура КАК Номенклатура,
			|	МатериалыВЭксплуатации.Характеристика КАК Характеристика,
			|	МатериалыВЭксплуатации.ДокументПередачи,
			|	МатериалыВЭксплуатации.ВидУчетаНУ,
			|	МатериалыВЭксплуатации.Сотрудник КАК Сотрудник,
			|	МатериалыВЭксплуатации.НазначениеИспользования,
			|	МатериалыВЭксплуатации.КоличествоОстаток КАК Количество,
			|	МатериалыВЭксплуатации.СтоимостьОстаток КАК Стоимость,
			|	МатериалыВЭксплуатации.СписаннаяСтоимостьОстаток КАК СписаннаяСтоимость,
			|	МатериалыВЭксплуатации.ОстаточныйСрокИспользования КАК ОстаточныйСрокИспользования
			|ПОМЕСТИТЬ ВТ_Материалы
			|ИЗ
			|	РегистрНакопления.си_МатериалыВЭксплуатации.Остатки(
			|			&МоментВремени,
			|			Организация = &Организация
			|				И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК МатериалыВЭксплуатации
			|ГДЕ
			|	МатериалыВЭксплуатации.СтоимостьОстаток <> 0
			|	ИЛИ (МатериалыВЭксплуатации.НазначениеИспользования.СпособПогашенияСтоимости = Значение(Перечисление.си_СпособыПогашенияСтоимости.ПриПередачеВЭксплуатацию)
			|		 И МатериалыВЭксплуатации.ОстаточныйСрокИспользования <> 0) 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МатериалыВЭксплуатации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
			|	МатериалыВЭксплуатации.Номенклатура КАК Номенклатура,
			|	МатериалыВЭксплуатации.Характеристика КАК Характеристика,
			|	МатериалыВЭксплуатации.ДокументПередачи,
			|	МатериалыВЭксплуатации.Сотрудник КАК Сотрудник,
			|	МатериалыВЭксплуатации.НазначениеИспользования,
			|	МатериалыВЭксплуатации.Количество КАК Количество,
			|	МатериалыВЭксплуатации.Стоимость КАК Стоимость,
			|	МатериалыВЭксплуатации.СписаннаяСтоимость КАК СписаннаяСтоимость,
			|	МатериалыВЭксплуатации.ОстаточныйСрокИспользования КАК ОстаточныйСрокИспользования,
			|	си_НазначенияИспользования.СпособПогашенияСтоимости,
			|	СпособыОтраженияРасходовПоАмортизации.Способы.(
			|		Ссылка,
			|		НомерСтроки,
			|		СчетЗатрат,
			|		Субконто1,
			|		Субконто2,
			|		Субконто3,
			|		Коэффициент
			|	),
			|	МатериалыВЭксплуатации.ВидУчетаНУ
			|ИЗ
			|	ВТ_Материалы КАК МатериалыВЭксплуатации
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.си_НазначенияИспользования КАК си_НазначенияИспользования
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
			|			ПО си_НазначенияИспользования.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизации.Ссылка
			|		ПО МатериалыВЭксплуатации.НазначениеИспользования = си_НазначенияИспользования.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПодразделениеОрганизации,
			|	Сотрудник,
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Материалы.Сотрудник
			|ПОМЕСТИТЬ ВТ_Сотрудники
			|ИЗ
			|	ВТ_Материалы КАК ВТ_Материалы
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Материалы.Сотрудник
			|;
			|"+?(Метаданные.РегистрыСведений.Найти(ИмяРегистраРаспределенияПоТабелю)<>Неопределено,"
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РаспределениеЗаработка.Сотрудник КАК Сотрудник,
			|	РаспределениеЗаработка."+Префикс+"ОбъектСтроительства КАК ОбъектСтроительства,
			|	РаспределениеЗаработка.ДоляСпособаОтражения,
			|	РаспределениеЗаработка."+Префикс+"Машина КАК Машина
			|ПОМЕСТИТЬ ВТ_РаспределениеПоТабелю
			|ИЗ
			|	РегистрСведений."+ИмяРегистраРаспределенияПоТабелю+" КАК РаспределениеЗаработка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
			|		ПО РаспределениеЗаработка.Сотрудник = ВТ_Сотрудники.Сотрудник
			|ГДЕ
			|	РаспределениеЗаработка.ПериодРегистрации = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Сотрудник","ВЫБРАТЬ
			|	NULL КАК Сотрудник,
			|	NULL КАК ОбъектСтроительства,
			|	NULL КАК ДоляСпособаОтражения,
			|	NULL КАК Машина
			|ПОМЕСТИТЬ ВТ_РаспределениеПоТабелю
			|ГДЕ
			|	ЛОЖЬ")+"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ФактическаяВыработка.Сотрудник,
			|	ФактическаяВыработка.ОбъектСтроительства,
			|	ФактическаяВыработка.ЧасовОборот,
			|	ФактическаяВыработка.Машина
			|ПОМЕСТИТЬ ВТ_РаспределениеПоВыработке
			|ИЗ
			//++УФСО
			|	РегистрНакопления.бсо_ФактическаяВыработкаРаботниковОрганизаций.Обороты(
			//--УФСО
			|			&НачалоПериода,
			|			&КонецПериода,
			|			,
			|			Организация = &Организация
			|				И Сотрудник В
			|					(ВЫБРАТЬ
			|						ВТ_Сотрудники.Сотрудник
			|					ИЗ
			|						ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК ФактическаяВыработка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_РаспределениеПоТабелю.Сотрудник,
			|	ВТ_РаспределениеПоТабелю.ОбъектСтроительства,
			|	ВТ_РаспределениеПоТабелю.ДоляСпособаОтражения КАК Доля,
			|	ВТ_РаспределениеПоТабелю.Машина,
			|	НоменклатурныеГруппы.Ссылка КАК НоменклатурнаяГруппа
			|ИЗ
			|	ВТ_РаспределениеПоТабелю КАК ВТ_РаспределениеПоТабелю
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
			|		ПО ВТ_РаспределениеПоТабелю.ОбъектСтроительства = НоменклатурныеГруппы.бсо_ОбъектСтроительства
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТ_РаспределениеПоВыработке.Сотрудник,
			|	ВТ_РаспределениеПоВыработке.ОбъектСтроительства,
			|	ВТ_РаспределениеПоВыработке.ЧасовОборот,
			|	ВТ_РаспределениеПоВыработке.Машина,
			|	НоменклатурныеГруппы.Ссылка
			|ИЗ
			|	ВТ_РаспределениеПоВыработке КАК ВТ_РаспределениеПоВыработке
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоТабелю КАК ВТ_РаспределениеПоТабелю
			|		ПО ВТ_РаспределениеПоВыработке.Сотрудник = ВТ_РаспределениеПоТабелю.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
			|		ПО ВТ_РаспределениеПоВыработке.ОбъектСтроительства = НоменклатурныеГруппы.бсо_ОбъектСтроительства
			|ГДЕ
			|	ВТ_РаспределениеПоТабелю.Сотрудник ЕСТЬ NULL 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыработкаМатериалов.ПодразделениеОрганизации,
			|	ВыработкаМатериалов.Номенклатура,
			|	ВыработкаМатериалов.Характеристика КАК Характеристика,
			|	ВыработкаМатериалов.ДокументПередачи,
			|	ВыработкаМатериалов.Сотрудник,
			|	ВыработкаМатериалов.НазначениеИспользования,
			|	ВыработкаМатериалов.ОбъектСтроительства,
			|	ВыработкаМатериалов.КоличествоОборотовОборот * ВыработкаМатериалов.КоличествоОборот КАК Оборотов,
			|	ВыработкаМатериалов.Регистратор
			|ИЗ
			|	РегистрНакопления.си_ВыработкаМатериаловВЭксплуатации.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Авто,
			|			Организация = &Организация
			|				И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК ВыработкаМатериалов"
			+ общ_ПереопределениеПроцедурБККлиентСервер.ТекстРазделителяЗапросовПакета();
			
			НомераТаблиц.Вставить("ТаблицаВспомогательнаяМатериалы",	НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаСпецодежда", 					НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВспомогательнаяСотрудники",	НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВспомогательнаяТабель",		НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВспомогательнаяВыработка", 	НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВыработкаСотрудников", 		НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВыработкаМатериалов", 		НомераТаблиц.Количество());
	Иначе
		ТекстЗапроса = "";
	
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	си_МатериалыВЭксплуатации.Организация,
			|	си_МатериалыВЭксплуатации.СтруктурноеПодразделение,
			|	си_МатериалыВЭксплуатации.ПодразделениеОрганизации,
			|	си_МатериалыВЭксплуатации.Номенклатура,
			|	си_МатериалыВЭксплуатации.ДокументПередачи,
			|	си_МатериалыВЭксплуатации.Сотрудник,
			|	си_МатериалыВЭксплуатации.НазначениеИспользования,
			|	си_МатериалыВЭксплуатации.ВидУчетаНУ,
			|	си_МатериалыВЭксплуатации.ОстаточныйСрокИспользования,
			|	си_МатериалыВЭксплуатации.Характеристика
			|ИЗ
			|	РегистрНакопления.си_МатериалыВЭксплуатации КАК си_МатериалыВЭксплуатации
			|ГДЕ
			|	си_МатериалыВЭксплуатации.КодОперации = ЗНАЧЕНИЕ(Перечисление.си_КодыОперацийМатериалыВЭксплуатации.СписаниеПартийВЭксплуатацию)
			|	И си_МатериалыВЭксплуатации.Период МЕЖДУ &НАЧАЛОПЕРИОДА И &КОНЕЦПЕРИОДА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МатериалыВЭксплуатации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
			|	МатериалыВЭксплуатации.Номенклатура КАК Номенклатура,
			|	МатериалыВЭксплуатации.Характеристика КАК Характеристика,
			|	МатериалыВЭксплуатации.ДокументПередачи,
			|	МатериалыВЭксплуатации.ВидУчетаНУ,
			|	МатериалыВЭксплуатации.Сотрудник КАК Сотрудник,
			|	МатериалыВЭксплуатации.НазначениеИспользования,
			|	МатериалыВЭксплуатации.КоличествоОстаток КАК Количество,
			|	МатериалыВЭксплуатации.СтоимостьОстаток КАК Стоимость,
			|	МатериалыВЭксплуатации.СписаннаяСтоимостьОстаток КАК СписаннаяСтоимость,
			|	МатериалыВЭксплуатации.ОстаточныйСрокИспользования КАК ОстаточныйСрокИспользования,
			|	МатериалыВЭксплуатации.Организация,
			|	МатериалыВЭксплуатации.СтруктурноеПодразделение
			|ПОМЕСТИТЬ ВТ_Материалы
			|ИЗ
			|	РегистрНакопления.си_МатериалыВЭксплуатации.Остатки(
			|			&МоментВремени,
			|			Организация = &Организация
			|				И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК МатериалыВЭксплуатации
			|ГДЕ
			|	(МатериалыВЭксплуатации.СтоимостьОстаток <> 0
			|			ИЛИ МатериалыВЭксплуатации.НазначениеИспользования.СпособПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.си_СпособыПогашенияСтоимости.ПриПередачеВЭксплуатацию)
			|				И МатериалыВЭксплуатации.ОстаточныйСрокИспользования <> 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МатериалыВЭксплуатации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
			|	МатериалыВЭксплуатации.Номенклатура КАК Номенклатура,
			|	МатериалыВЭксплуатации.Характеристика КАК Характеристика,
			|	МатериалыВЭксплуатации.ДокументПередачи,
			|	МатериалыВЭксплуатации.Сотрудник КАК Сотрудник,
			|	МатериалыВЭксплуатации.НазначениеИспользования,
			|	МатериалыВЭксплуатации.Количество КАК Количество,
			|	МатериалыВЭксплуатации.Стоимость КАК Стоимость,
			|	МатериалыВЭксплуатации.СписаннаяСтоимость КАК СписаннаяСтоимость,
			|	МатериалыВЭксплуатации.ОстаточныйСрокИспользования КАК ОстаточныйСрокИспользования,
			|	си_НазначенияИспользования.СпособПогашенияСтоимости,
			|	СпособыОтраженияРасходовПоАмортизации.Способы.(
			|		Ссылка,
			|		НомерСтроки,
			|		СчетЗатрат,
			|		Субконто1,
			|		Субконто2,
			|		Субконто3,
			|		Коэффициент
			|	),
			|	МатериалыВЭксплуатации.ВидУчетаНУ
			|ИЗ
			|	ВТ_Материалы КАК МатериалыВЭксплуатации
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.си_НазначенияИспользования КАК си_НазначенияИспользования
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
			|			ПО си_НазначенияИспользования.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизации.Ссылка
			|		ПО МатериалыВЭксплуатации.НазначениеИспользования = си_НазначенияИспользования.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПодразделениеОрганизации,
			|	Сотрудник,
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Материалы.Сотрудник
			|ПОМЕСТИТЬ ВТ_Сотрудники
			|ИЗ
			|	ВТ_Материалы КАК ВТ_Материалы
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Материалы.Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыработкаМатериалов.ПодразделениеОрганизации,
			|	ВыработкаМатериалов.Номенклатура,
			|	ВыработкаМатериалов.Характеристика КАК Характеристика,
			|	ВыработкаМатериалов.ДокументПередачи,
			|	ВыработкаМатериалов.Сотрудник,
			|	ВыработкаМатериалов.НазначениеИспользования,
			|	ВыработкаМатериалов.ОбъектСтроительства,
			|	ВыработкаМатериалов.КоличествоОборотовОборот * ВыработкаМатериалов.КоличествоОборот КАК Оборотов,
			|	ВыработкаМатериалов.Регистратор
			|ИЗ
			|	РегистрНакопления.си_ВыработкаМатериаловВЭксплуатации.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Авто,
			|			Организация = &Организация
			|				И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК ВыработкаМатериалов"
			+ общ_ПереопределениеПроцедурБККлиентСервер.ТекстРазделителяЗапросовПакета();
			
			НомераТаблиц.Вставить("ТаблицаВспомогательнаяПереданныеМатериалы",	НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВспомогательнаяМатериалы",	НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаСпецодежда", 					НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВспомогательнаяСотрудники",	НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ТаблицаВыработкаМатериалов", 		НомераТаблиц.Количество());
	КонецЕсли;
		
	Возврат ТекстЗапроса;	
КонецФункции 

Функция ТекстЗапросаСпецодеждаБУ(НомераТаблиц,ПараметрыПроведения, Реквизиты)  Экспорт

	ТекстЗапроса = "";
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	МатериалыВЭксплуатации.Склад КАК Склад,
		|	МатериалыВЭксплуатации.Номенклатура КАК Номенклатура,
		|	МатериалыВЭксплуатации.Характеристика КАК Характеристика,
		|	МатериалыВЭксплуатации.ДокументПередачи,
		|	МатериалыВЭксплуатации.НазначениеИспользования,
		|	МатериалыВЭксплуатации.ВидУчетаНУ,
		|	МатериалыВЭксплуатации.КоличествоОстаток КАК Количество,
		|	МатериалыВЭксплуатации.СтоимостьОстаток КАК Стоимость,
		|	МатериалыВЭксплуатации.СписаннаяСтоимостьОстаток КАК СписаннаяСтоимость,
		|	МатериалыВЭксплуатации.ОстаточныйСрокИспользования КАК ОстаточныйСрокИспользования,
		|	МатериалыВЭксплуатации.ДокументВозврата
		|ПОМЕСТИТЬ ВТ_МатериалыБУ
		|ИЗ
		|	РегистрНакопления.си_МатериалыНаСкладе.Остатки(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК МатериалыВЭксплуатации
		|ГДЕ
		|	(МатериалыВЭксплуатации.СтоимостьОстаток <> 0
		|			ИЛИ МатериалыВЭксплуатации.НазначениеИспользования.СпособПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.си_СпособыПогашенияСтоимости.ПриПередачеВЭксплуатацию)
		|				И МатериалыВЭксплуатации.ОстаточныйСрокИспользования <> 0)
		|	И НЕ МатериалыВЭксплуатации.НазначениеИспользования.СпособПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.си_СпособыПогашенияСтоимости.Производственный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МатериалыВЭксплуатации.Склад,
		|	МатериалыВЭксплуатации.Номенклатура,
		|	МатериалыВЭксплуатации.Характеристика,
		|	МатериалыВЭксплуатации.ДокументПередачи,
		|	МатериалыВЭксплуатации.НазначениеИспользования,
		|	МатериалыВЭксплуатации.ВидУчетаНУ,
		|	МатериалыВЭксплуатации.КоличествоОстаток,
		|	МатериалыВЭксплуатации.СтоимостьОстаток,
		|	МатериалыВЭксплуатации.СписаннаяСтоимостьОстаток,
		|	МатериалыВЭксплуатации.ОстаточныйСрокИспользования,
		|	МатериалыВЭксплуатации.ДокументВозврата
		|ИЗ
		|	РегистрНакопления.си_МатериалыНаСкладе.Остатки(
		|			&МоментВремениТекущий,
		|			Организация = &Организация
		|				И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК МатериалыВЭксплуатации
		|ГДЕ
		|	(МатериалыВЭксплуатации.СтоимостьОстаток <> 0
		|			ИЛИ МатериалыВЭксплуатации.НазначениеИспользования.СпособПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.си_СпособыПогашенияСтоимости.ПриПередачеВЭксплуатацию)
		|				И МатериалыВЭксплуатации.ОстаточныйСрокИспользования <> 0)
		|	И МатериалыВЭксплуатации.НазначениеИспользования.СпособПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.си_СпособыПогашенияСтоимости.Производственный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	си_МатериалыНаСкладе.Склад КАК Склад,
		|	си_МатериалыНаСкладе.Номенклатура,
		|	си_МатериалыНаСкладе.ДокументПередачи,
		|	си_МатериалыНаСкладе.НазначениеИспользования,
		|	си_МатериалыНаСкладе.ВидУчетаНУ,
		|	си_МатериалыНаСкладе.ОстаточныйСрокИспользования,
		|	си_МатериалыНаСкладе.Характеристика,
		|	си_МатериалыНаСкладе.СостояниеСпецодежды,
		|	си_МатериалыНаСкладе.КоличествоОстаток КАК Количество,
		|	си_МатериалыНаСкладе.СтоимостьОстаток КАК Стоимость,
		|	си_МатериалыНаСкладе.СписаннаяСтоимостьОстаток КАК СписаннаяСтоимость,
		|	си_МатериалыНаСкладе.ДокументВозврата
		|ПОМЕСТИТЬ ВТ_ВозвращенныеМатериалы
		|ИЗ
		|	РегистрНакопления.си_МатериалыНаСкладе.Остатки(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И СтруктурноеПодразделение = &СтруктурноеПодразделение
		|				И (ДокументВозврата.Дата МЕЖДУ &НачалоПериодаВозврата И &КонецПериодаВозврата)
		|				И &АмортизироватьВМесяцВозврата
		|				И НазначениеИспользования.ПриостанавливатьАмортизациюНаВремяВозврата = ИСТИНА) КАК си_МатериалыНаСкладе
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МатериалыВЭксплуатации.Склад КАК Склад,
		|	МатериалыВЭксплуатации.ВидУчетаНУ,
		|	МатериалыВЭксплуатации.Номенклатура КАК Номенклатура,
		|	МатериалыВЭксплуатации.Характеристика КАК Характеристика,
		|	МатериалыВЭксплуатации.ДокументПередачи,
		|	МатериалыВЭксплуатации.НазначениеИспользования,
		|	МатериалыВЭксплуатации.Количество КАК Количество,
		|	МатериалыВЭксплуатации.Стоимость КАК Стоимость,
		|	МатериалыВЭксплуатации.СписаннаяСтоимость КАК СписаннаяСтоимость,
		|	МатериалыВЭксплуатации.ОстаточныйСрокИспользования КАК ОстаточныйСрокИспользования,
		|	си_НазначенияИспользования.СпособПогашенияСтоимости,
		|	СпособыОтраженияРасходовПоАмортизации.Способы.(
		|		Ссылка,
		|		НомерСтроки,
		|		СчетЗатрат,
		|		Субконто1,
		|		Субконто2,
		|		Субконто3,
		|		Коэффициент
		|	),
		|	МатериалыВЭксплуатации.ДокументВозврата
		|ИЗ
		|	ВТ_МатериалыБУ КАК МатериалыВЭксплуатации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.си_НазначенияИспользования КАК си_НазначенияИспользования
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
		|			ПО си_НазначенияИспользования.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизации.Ссылка
		|		ПО МатериалыВЭксплуатации.НазначениеИспользования = си_НазначенияИспользования.Ссылка
		|ГДЕ
		|	си_НазначенияИспользования.ПриостанавливатьАмортизациюНаВремяВозврата = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ВозвращенныеМатериалы.Склад,
		|	ВТ_ВозвращенныеМатериалы.ВидУчетаНУ,
		|	ВТ_ВозвращенныеМатериалы.Номенклатура,
		|	ВТ_ВозвращенныеМатериалы.Характеристика,
		|	ВТ_ВозвращенныеМатериалы.ДокументПередачи,
		|	ВТ_ВозвращенныеМатериалы.НазначениеИспользования,
		|	ВТ_ВозвращенныеМатериалы.Количество,
		|	ВТ_ВозвращенныеМатериалы.Стоимость,
		|	ВТ_ВозвращенныеМатериалы.СписаннаяСтоимость,
		|	ВТ_ВозвращенныеМатериалы.ОстаточныйСрокИспользования,
		|	си_НазначенияИспользования.СпособПогашенияСтоимости,
		|	СпособыОтраженияРасходовПоАмортизации.Способы.(
		|		Ссылка,
		|		НомерСтроки,
		|		СчетЗатрат,
		|		Субконто1,
		|		Субконто2,
		|		Субконто3,
		|		Коэффициент
		|	),
		|	ВТ_ВозвращенныеМатериалы.ДокументВозврата
		|ИЗ
		|	ВТ_ВозвращенныеМатериалы КАК ВТ_ВозвращенныеМатериалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.си_НазначенияИспользования КАК си_НазначенияИспользования
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
		|			ПО си_НазначенияИспользования.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизации.Ссылка
		|		ПО ВТ_ВозвращенныеМатериалы.НазначениеИспользования = си_НазначенияИспользования.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура"
		+ общ_ПереопределениеПроцедурБККлиентСервер.ТекстРазделителяЗапросовПакета();
		
		НомераТаблиц.Вставить("ТаблицаВспомогательнаяСпецодеждаБУ",		НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ТаблицаВспомогательнаяСпецодеждаБУВозвращенная",		НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ТаблицаСпецодеждаБУ", 					НомераТаблиц.Количество());
		
	
	Возврат ТекстЗапроса;	
КонецФункции 

#КонецОбласти

#КонецЕсли
